{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.4", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "90"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "90"}]}}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_3/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_3/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "25"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/flatten/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "5"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/Reshape/shape/1", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/conv1d/ExpandDims_1", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "5"}, {"size": "1"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/flatten_1/Const", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_1/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "72"}, {"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_2/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_4/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/concatenate/concat/axis", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/split", "op": "SplitV", "input": ["input_1", "StatefulPartitionedCall/convolution_model/Const", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "num_split": {"i": "5"}, "Tlen": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/convolution_model/split:2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/convolution_model/split:3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/concatenate/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/convolution_model/split", "StatefulPartitionedCall/convolution_model/split:1", "StatefulPartitionedCall/convolution_model/split:4", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/convolution_model/reshape/Shape", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/convolution_model/reshape_1/Shape", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/convolution_model/concatenate/concat", "StatefulPartitionedCall/convolution_model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/convolution_model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/convolution_model/reshape/strided_slice", "StatefulPartitionedCall/convolution_model/reshape/Reshape/shape/1", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/convolution_model/reshape_1/strided_slice", "StatefulPartitionedCall/convolution_model/reshape_1/Reshape/shape/1", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/convolution_model/split:2", "StatefulPartitionedCall/convolution_model/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/convolution_model/split:3", "StatefulPartitionedCall/convolution_model/reshape_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/convolution_model/reshape/Reshape", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/conv1d/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/convolution_model/reshape_1/Reshape", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/convolution_model/conv1d/conv1d/ExpandDims", "StatefulPartitionedCall/convolution_model/conv1d/conv1d/ExpandDims_1", "StatefulPartitionedCall/convolution_model/conv1d/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "5", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/conv1d", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/convolution_model/conv1d_1/conv1d/ExpandDims", "StatefulPartitionedCall/convolution_model/conv1d_1/conv1d/ExpandDims_1", "StatefulPartitionedCall/convolution_model/conv1d_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "5", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/convolution_model/conv1d/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/convolution_model/conv1d_1/conv1d"], "attr": {"squeeze_dims": {"list": {"i": ["1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/convolution_model/conv1d/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/convolution_model/conv1d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/convolution_model/conv1d/Relu", "StatefulPartitionedCall/convolution_model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/convolution_model/conv1d_1/Relu", "StatefulPartitionedCall/convolution_model/flatten_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/convolution_model/dense/Relu", "StatefulPartitionedCall/convolution_model/flatten/Reshape", "StatefulPartitionedCall/convolution_model/flatten_1/Reshape", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/convolution_model/concatenate_1/concat", "StatefulPartitionedCall/convolution_model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/convolution_model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_2/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/convolution_model/dense_1/Relu", "StatefulPartitionedCall/convolution_model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/convolution_model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_4/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/convolution_model/dense_2/Relu", "StatefulPartitionedCall/convolution_model/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/convolution_model/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_3/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/convolution_model/dense_2/Relu", "StatefulPartitionedCall/convolution_model/dense_3/MatMul/ReadVariableOp", "StatefulPartitionedCall/convolution_model/dense_3/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/convolution_model/dense_3/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/convolution_model/dense_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/convolution_model/concatenate_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/convolution_model/dense_3/Softmax", "StatefulPartitionedCall/convolution_model/dense_4/BiasAdd", "StatefulPartitionedCall/convolution_model/concatenate/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/convolution_model/concatenate_2/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/convolution_model/dense_3/MatMul/ReadVariableOp", "shape": [20, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_3/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense/MatMul/ReadVariableOp", "shape": [25, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/conv1d/ExpandDims_1", "shape": [1, 5, 1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/conv1d/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/Const", "shape": [5], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/reshape_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/conv1d/ExpandDims_1", "shape": [1, 5, 1, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/conv1d_1/BiasAdd/ReadVariableOp", "shape": [4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/flatten_1/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_1/MatMul/ReadVariableOp", "shape": [72, 30], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_1/BiasAdd/ReadVariableOp", "shape": [30], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_2/MatMul/ReadVariableOp", "shape": [30, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_2/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_4/MatMul/ReadVariableOp", "shape": [20, 7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/dense_4/BiasAdd/ReadVariableOp", "shape": [7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/convolution_model/concatenate/concat/axis", "shape": [], "dtype": "int32"}]}]}