{"format": "graph-model", "generatedBy": "2.1.0", "convertedBy": "TensorFlow.js Converter v1.7.4", "userDefinedMetadata": {"signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "75"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}}, "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "75"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "75"}, {"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "80"}, {"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "op": "Const", "input": ["^input_1"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "60"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/Relu", "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/Relu", "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}], "versions": {"producer": 175}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "shape": [75, 80], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "shape": [60, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "shape": [80], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/MatMul/ReadVariableOp", "shape": [80, 60], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/StatefulPartitionedCall/StatefulPartitionedCall/BiasAdd/ReadVariableOp", "shape": [60], "dtype": "float32"}]}]}