{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "disc_x"}, "name": "disc_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "disc_y"}, "name": "disc_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "disc_z"}, "name": "disc_z", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "offensiveGoalDirection"}, "name": "offensiveGoalDirection", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int32", "sparse": false, "ragged": false, "name": "offensiveTeam"}, "name": "offensiveTeam", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "stallCount"}, "name": "stallCount", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "string", "sparse": false, "ragged": false, "name": "state"}, "name": "state", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_0_vx"}, "name": "team_0_player_0_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_0_vy"}, "name": "team_0_player_0_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_0_x"}, "name": "team_0_player_0_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_0_y"}, "name": "team_0_player_0_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_1_vx"}, "name": "team_0_player_1_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_1_vy"}, "name": "team_0_player_1_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_1_x"}, "name": "team_0_player_1_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_1_y"}, "name": "team_0_player_1_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_2_vx"}, "name": "team_0_player_2_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_2_vy"}, "name": "team_0_player_2_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_2_x"}, "name": "team_0_player_2_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_2_y"}, "name": "team_0_player_2_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_3_vx"}, "name": "team_0_player_3_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_3_vy"}, "name": "team_0_player_3_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_3_x"}, "name": "team_0_player_3_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_3_y"}, "name": "team_0_player_3_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_4_vx"}, "name": "team_0_player_4_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_4_vy"}, "name": "team_0_player_4_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_4_x"}, "name": "team_0_player_4_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_4_y"}, "name": "team_0_player_4_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_5_vx"}, "name": "team_0_player_5_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_5_vy"}, "name": "team_0_player_5_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_5_x"}, "name": "team_0_player_5_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_5_y"}, "name": "team_0_player_5_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_6_vx"}, "name": "team_0_player_6_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_6_vy"}, "name": "team_0_player_6_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_6_x"}, "name": "team_0_player_6_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_0_player_6_y"}, "name": "team_0_player_6_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_0_vx"}, "name": "team_1_player_0_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_0_vy"}, "name": "team_1_player_0_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_0_x"}, "name": "team_1_player_0_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_0_y"}, "name": "team_1_player_0_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_1_vx"}, "name": "team_1_player_1_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_1_vy"}, "name": "team_1_player_1_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_1_x"}, "name": "team_1_player_1_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_1_y"}, "name": "team_1_player_1_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_2_vx"}, "name": "team_1_player_2_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_2_vy"}, "name": "team_1_player_2_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_2_x"}, "name": "team_1_player_2_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_2_y"}, "name": "team_1_player_2_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_3_vx"}, "name": "team_1_player_3_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_3_vy"}, "name": "team_1_player_3_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_3_x"}, "name": "team_1_player_3_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_3_y"}, "name": "team_1_player_3_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_4_vx"}, "name": "team_1_player_4_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_4_vy"}, "name": "team_1_player_4_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_4_x"}, "name": "team_1_player_4_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_4_y"}, "name": "team_1_player_4_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_5_vx"}, "name": "team_1_player_5_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_5_vy"}, "name": "team_1_player_5_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_5_x"}, "name": "team_1_player_5_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_5_y"}, "name": "team_1_player_5_y", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_6_vx"}, "name": "team_1_player_6_vx", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_6_vy"}, "name": "team_1_player_6_vy", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_6_x"}, "name": "team_1_player_6_x", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "team_1_player_6_y"}, "name": "team_1_player_6_y", "inbound_nodes": []}, {"class_name": "DenseFeatures", "config": {"name": "dense_features", "trainable": true, "dtype": "float32", "feature_columns": [{"class_name": "NumericColumn", "config": {"key": "disc_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "disc_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "disc_z", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "offensiveGoalDirection", "vocabulary_list": ["E", "W"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "offensiveTeam", "vocabulary_list": [0, 1], "dtype": "int64", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "stallCount", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "IndicatorColumn", "config": {"categorical_column": {"class_name": "VocabularyListCategoricalColumn", "config": {"key": "state", "vocabulary_list": ["receiving", "pickup", "normal"], "dtype": "string", "default_value": -1, "num_oov_buckets": 0}}}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_0_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_0_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_0_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_0_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_1_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_1_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_1_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_1_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_2_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_2_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_2_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_2_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_3_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_3_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_3_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_3_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_4_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_4_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_4_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_4_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_5_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_5_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_5_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_5_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_6_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_6_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_6_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_0_player_6_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_0_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_0_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_0_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_0_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_1_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_1_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_1_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_1_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_2_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_2_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_2_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_2_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_3_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_3_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_3_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_3_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_4_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_4_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_4_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_4_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_5_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_5_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_5_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_5_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_6_vx", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_6_vy", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_6_x", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}, {"class_name": "NumericColumn", "config": {"key": "team_1_player_6_y", "shape": [1], "default_value": null, "dtype": "float32", "normalizer_fn": null}}]}, "name": "dense_features", "inbound_nodes": [{"state": ["state", 0, 0, {}], "offensiveGoalDirection": ["offensiveGoalDirection", 0, 0, {}], "offensiveTeam": ["offensiveTeam", 0, 0, {}], "stallCount": ["stallCount", 0, 0, {}], "disc_x": ["disc_x", 0, 0, {}], "disc_y": ["disc_y", 0, 0, {}], "disc_z": ["disc_z", 0, 0, {}], "team_0_player_0_x": ["team_0_player_0_x", 0, 0, {}], "team_0_player_0_y": ["team_0_player_0_y", 0, 0, {}], "team_0_player_0_vx": ["team_0_player_0_vx", 0, 0, {}], "team_0_player_0_vy": ["team_0_player_0_vy", 0, 0, {}], "team_0_player_1_x": ["team_0_player_1_x", 0, 0, {}], "team_0_player_1_y": ["team_0_player_1_y", 0, 0, {}], "team_0_player_1_vx": ["team_0_player_1_vx", 0, 0, {}], "team_0_player_1_vy": ["team_0_player_1_vy", 0, 0, {}], "team_0_player_2_x": ["team_0_player_2_x", 0, 0, {}], "team_0_player_2_y": ["team_0_player_2_y", 0, 0, {}], "team_0_player_2_vx": ["team_0_player_2_vx", 0, 0, {}], "team_0_player_2_vy": ["team_0_player_2_vy", 0, 0, {}], "team_0_player_3_x": ["team_0_player_3_x", 0, 0, {}], "team_0_player_3_y": ["team_0_player_3_y", 0, 0, {}], "team_0_player_3_vx": ["team_0_player_3_vx", 0, 0, {}], "team_0_player_3_vy": ["team_0_player_3_vy", 0, 0, {}], "team_0_player_4_x": ["team_0_player_4_x", 0, 0, {}], "team_0_player_4_y": ["team_0_player_4_y", 0, 0, {}], "team_0_player_4_vx": ["team_0_player_4_vx", 0, 0, {}], "team_0_player_4_vy": ["team_0_player_4_vy", 0, 0, {}], "team_0_player_5_x": ["team_0_player_5_x", 0, 0, {}], "team_0_player_5_y": ["team_0_player_5_y", 0, 0, {}], "team_0_player_5_vx": ["team_0_player_5_vx", 0, 0, {}], "team_0_player_5_vy": ["team_0_player_5_vy", 0, 0, {}], "team_0_player_6_x": ["team_0_player_6_x", 0, 0, {}], "team_0_player_6_y": ["team_0_player_6_y", 0, 0, {}], "team_0_player_6_vx": ["team_0_player_6_vx", 0, 0, {}], "team_0_player_6_vy": ["team_0_player_6_vy", 0, 0, {}], "team_1_player_0_x": ["team_1_player_0_x", 0, 0, {}], "team_1_player_0_y": ["team_1_player_0_y", 0, 0, {}], "team_1_player_0_vx": ["team_1_player_0_vx", 0, 0, {}], "team_1_player_0_vy": ["team_1_player_0_vy", 0, 0, {}], "team_1_player_1_x": ["team_1_player_1_x", 0, 0, {}], "team_1_player_1_y": ["team_1_player_1_y", 0, 0, {}], "team_1_player_1_vx": ["team_1_player_1_vx", 0, 0, {}], "team_1_player_1_vy": ["team_1_player_1_vy", 0, 0, {}], "team_1_player_2_x": ["team_1_player_2_x", 0, 0, {}], "team_1_player_2_y": ["team_1_player_2_y", 0, 0, {}], "team_1_player_2_vx": ["team_1_player_2_vx", 0, 0, {}], "team_1_player_2_vy": ["team_1_player_2_vy", 0, 0, {}], "team_1_player_3_x": ["team_1_player_3_x", 0, 0, {}], "team_1_player_3_y": ["team_1_player_3_y", 0, 0, {}], "team_1_player_3_vx": ["team_1_player_3_vx", 0, 0, {}], "team_1_player_3_vy": ["team_1_player_3_vy", 0, 0, {}], "team_1_player_4_x": ["team_1_player_4_x", 0, 0, {}], "team_1_player_4_y": ["team_1_player_4_y", 0, 0, {}], "team_1_player_4_vx": ["team_1_player_4_vx", 0, 0, {}], "team_1_player_4_vy": ["team_1_player_4_vy", 0, 0, {}], "team_1_player_5_x": ["team_1_player_5_x", 0, 0, {}], "team_1_player_5_y": ["team_1_player_5_y", 0, 0, {}], "team_1_player_5_vx": ["team_1_player_5_vx", 0, 0, {}], "team_1_player_5_vy": ["team_1_player_5_vy", 0, 0, {}], "team_1_player_6_x": ["team_1_player_6_x", 0, 0, {}], "team_1_player_6_y": ["team_1_player_6_y", 0, 0, {}], "team_1_player_6_vx": ["team_1_player_6_vx", 0, 0, {}], "team_1_player_6_vy": ["team_1_player_6_vy", 0, 0, {}]}]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dense_features", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 60, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": {"state": ["state", 0, 0], "offensiveGoalDirection": ["offensiveGoalDirection", 0, 0], "offensiveTeam": ["offensiveTeam", 0, 0], "stallCount": ["stallCount", 0, 0], "disc_x": ["disc_x", 0, 0], "disc_y": ["disc_y", 0, 0], "disc_z": ["disc_z", 0, 0], "team_0_player_0_x": ["team_0_player_0_x", 0, 0], "team_0_player_0_y": ["team_0_player_0_y", 0, 0], "team_0_player_0_vx": ["team_0_player_0_vx", 0, 0], "team_0_player_0_vy": ["team_0_player_0_vy", 0, 0], "team_0_player_1_x": ["team_0_player_1_x", 0, 0], "team_0_player_1_y": ["team_0_player_1_y", 0, 0], "team_0_player_1_vx": ["team_0_player_1_vx", 0, 0], "team_0_player_1_vy": ["team_0_player_1_vy", 0, 0], "team_0_player_2_x": ["team_0_player_2_x", 0, 0], "team_0_player_2_y": ["team_0_player_2_y", 0, 0], "team_0_player_2_vx": ["team_0_player_2_vx", 0, 0], "team_0_player_2_vy": ["team_0_player_2_vy", 0, 0], "team_0_player_3_x": ["team_0_player_3_x", 0, 0], "team_0_player_3_y": ["team_0_player_3_y", 0, 0], "team_0_player_3_vx": ["team_0_player_3_vx", 0, 0], "team_0_player_3_vy": ["team_0_player_3_vy", 0, 0], "team_0_player_4_x": ["team_0_player_4_x", 0, 0], "team_0_player_4_y": ["team_0_player_4_y", 0, 0], "team_0_player_4_vx": ["team_0_player_4_vx", 0, 0], "team_0_player_4_vy": ["team_0_player_4_vy", 0, 0], "team_0_player_5_x": ["team_0_player_5_x", 0, 0], "team_0_player_5_y": ["team_0_player_5_y", 0, 0], "team_0_player_5_vx": ["team_0_player_5_vx", 0, 0], "team_0_player_5_vy": ["team_0_player_5_vy", 0, 0], "team_0_player_6_x": ["team_0_player_6_x", 0, 0], "team_0_player_6_y": ["team_0_player_6_y", 0, 0], "team_0_player_6_vx": ["team_0_player_6_vx", 0, 0], "team_0_player_6_vy": ["team_0_player_6_vy", 0, 0], "team_1_player_0_x": ["team_1_player_0_x", 0, 0], "team_1_player_0_y": ["team_1_player_0_y", 0, 0], "team_1_player_0_vx": ["team_1_player_0_vx", 0, 0], "team_1_player_0_vy": ["team_1_player_0_vy", 0, 0], "team_1_player_1_x": ["team_1_player_1_x", 0, 0], "team_1_player_1_y": ["team_1_player_1_y", 0, 0], "team_1_player_1_vx": ["team_1_player_1_vx", 0, 0], "team_1_player_1_vy": ["team_1_player_1_vy", 0, 0], "team_1_player_2_x": ["team_1_player_2_x", 0, 0], "team_1_player_2_y": ["team_1_player_2_y", 0, 0], "team_1_player_2_vx": ["team_1_player_2_vx", 0, 0], "team_1_player_2_vy": ["team_1_player_2_vy", 0, 0], "team_1_player_3_x": ["team_1_player_3_x", 0, 0], "team_1_player_3_y": ["team_1_player_3_y", 0, 0], "team_1_player_3_vx": ["team_1_player_3_vx", 0, 0], "team_1_player_3_vy": ["team_1_player_3_vy", 0, 0], "team_1_player_4_x": ["team_1_player_4_x", 0, 0], "team_1_player_4_y": ["team_1_player_4_y", 0, 0], "team_1_player_4_vx": ["team_1_player_4_vx", 0, 0], "team_1_player_4_vy": ["team_1_player_4_vy", 0, 0], "team_1_player_5_x": ["team_1_player_5_x", 0, 0], "team_1_player_5_y": ["team_1_player_5_y", 0, 0], "team_1_player_5_vx": ["team_1_player_5_vx", 0, 0], "team_1_player_5_vy": ["team_1_player_5_vy", 0, 0], "team_1_player_6_x": ["team_1_player_6_x", 0, 0], "team_1_player_6_y": ["team_1_player_6_y", 0, 0], "team_1_player_6_vx": ["team_1_player_6_vx", 0, 0], "team_1_player_6_vy": ["team_1_player_6_vy", 0, 0]}, "output_layers": [["dense_2", 0, 0]]}}, "training_config": {"loss": {"class_name": "MeanSquaredError", "config": {"reduction": "auto", "name": "mean_squared_error"}}, "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [67, 80], "dtype": "float32"}, {"name": "dense/bias", "shape": [80], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [80, 60], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [60], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [60, 10], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32"}]}]}